-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 10 2024 г., 00:05
-- Версия сервера: 5.6.51
-- Версия PHP: 8.0.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `misha-catalog2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'Саморезы'),
(2, 'Дюбеля'),
(3, 'Расходные материалы'),
(4, 'Анкера'),
(5, 'Гвозди'),
(6, 'Метрика'),
(7, 'Заклепки'),
(8, 'Пластины и уголки'),
(9, 'Такелаж'),
(10, 'Хомут-стяжка');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `img` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `subcategory` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `img`, `subcategory`, `category_id`) VALUES
(7, 'Саморез по дереву 3,5*16 мм (100 гр)', NULL, 'derevo', 1),
(8, 'Саморез по дереву 3,5*19 мм (100 гр)', NULL, 'derevo', 1),
(9, 'Саморез по дереву 3,5*25 мм (100 гр)', NULL, 'derevo', 1),
(10, 'Саморез по дереву 3,5*32 мм ( 100 гр)', NULL, 'derevo', 1),
(11, 'Саморез по дереву 3,5*35 мм (100 гр)', NULL, 'derevo', 1),
(12, 'Саморез по дереву 3,5*41 мм (100 гр)', NULL, 'derevo', 1),
(13, 'Саморез по дереву 3,5*45 мм (100 гр)', NULL, 'derevo', 1),
(14, 'Саморез по дереву 3,5*51 мм (100 гр)', NULL, 'derevo', 1),
(15, 'Саморез по дереву 3,5*55 мм (100 гр)', NULL, 'derevo', 1),
(16, 'Саморез по дереву 3,8*64 мм (100 гр)', NULL, 'derevo', 1),
(17, 'Саморез по дереву 4,2*70 мм (100 гр)', NULL, 'derevo', 1),
(18, 'Саморез по дереву 4,2*76 мм (100 гр)', NULL, 'derevo', 1),
(19, 'Саморез по дереву 3,5*16 мм (1000 шт)', NULL, 'derevo', 1),
(20, 'Саморез по дереву 3,5*19 мм (1000 шт)', NULL, 'derevo', 1),
(21, 'Саморез по дереву 3,5*25 мм (800 шт)', NULL, 'derevo', 1),
(22, 'Саморез по дереву 3,5*32 мм (700 шт)', NULL, 'derevo', 1),
(23, 'Саморез по дереву 3,5*35 мм (600 шт)', NULL, 'derevo', 1),
(24, 'Саморез по дереву 3,5*41 мм (500 шт)', NULL, 'derevo', 1),
(25, 'Саморез по дереву 3,5*45 мм (400 шт)', NULL, 'derevo', 1),
(26, 'Саморез по дереву 3,5*51 мм (300 шт)', NULL, 'derevo', 1),
(27, 'Саморез по дереву 3,5*55 мм (250 шт)', NULL, 'derevo', 1),
(28, 'Саморез по дереву 3,8*64 мм (250 шт)', NULL, 'derevo', 1),
(29, 'Саморез по дереву 4,2*70 мм (250 шт)', NULL, 'derevo', 1),
(30, 'Саморез по дереву 4,2*76 мм (250 шт)', NULL, 'derevo', 1),
(31, 'Саморез по дереву 4,2*90 мм (150 шт)', NULL, 'derevo', 1),
(32, 'Саморез по дереву 4,8* 95 мм (100 шт)', NULL, 'derevo', 1),
(33, 'Саморез по дереву 4,8*100 мм (100 шт)', NULL, 'derevo', 1),
(34, 'Саморез по дереву 4,8*110 мм (100 шт)', NULL, 'derevo', 1),
(35, 'Саморез по дереву 4,8*120 мм (100 шт)', NULL, 'derevo', 1),
(36, 'Саморез по дереву 4,8*130 мм (100 шт)', NULL, 'derevo', 1),
(37, 'Саморез по дереву 4,8*152 мм (100 шт)', NULL, 'derevo', 1),
(38, 'Саморез по металлу 3,5*16 мм (100 гр)', NULL, 'metal', 1),
(39, 'Саморез по металлу 3,5*19 мм (100 гр)', NULL, 'metal', 1),
(40, 'Саморез по металлу 3,5*25 мм (100 гр)', NULL, 'metal', 1),
(41, 'Саморез по металлу 3,5*32 мм (100 гр)', NULL, 'metal', 1),
(42, 'Саморез по металлу 3,5*35 мм (100 гр)', NULL, 'metal', 1),
(43, 'Саморез по металлу 3,5*16 мм (1000 шт)', NULL, 'metal', 1),
(44, 'Саморез по металлу 3,5*19 мм (1000 шт)', NULL, 'metal', 1),
(45, 'Саморез по металлу 3,5*25 мм (800 шт)', NULL, 'metal', 1),
(46, 'Саморез по металлу 3,5*32 мм (700 шт)', NULL, 'metal', 1),
(47, 'Саморез по металлу 3,5*35 мм (600 шт)', NULL, 'metal', 1),
(48, 'Саморез кров. по дереву, цинк 4,8* 35 мм (100 гр)', NULL, 'krovel-derevo', 1),
(49, 'Саморез кров. по дереву, цинк 4,8* 51 мм (100 гр)', NULL, 'krovel-derevo', 1),
(50, 'Саморез кров. по дереву, цинк 4,8* 60 мм (100 гр)', NULL, 'krovel-derevo', 1),
(51, 'Саморез кров. по дереву, цинк 4,8* 70 мм (100 гр)', NULL, 'krovel-derevo', 1),
(52, 'Саморез кров. по дереву, цинк 4,8* 80 мм (100 гр)', NULL, 'krovel-derevo', 1),
(53, 'Саморез кров. по металлу цинк 5,5* 19 мм (100 гр)', NULL, 'krovel-metal', 1),
(54, 'Саморез кров. по металлу цинк 5,5* 25 мм (100 гр)', NULL, 'krovel-metal', 1),
(55, 'Саморез кров. по металлу цинк 5,5* 32 мм (100 гр)', NULL, 'krovel-metal', 1),
(56, 'Саморез кров. по металлу цинк 5,5* 38 мм (100 гр)', NULL, 'krovel-metal', 1),
(57, 'Саморез кров. по металлу цинк 5,5* 51 мм (100 гр)', NULL, 'krovel-metal', 1),
(58, 'Саморез кров. по металлу цинк 5,5* 64 мм (100 гр)', NULL, 'krovel-metal', 1),
(59, 'Саморез кров. по металлу цинк 5,5* 76 мм (100 гр)', NULL, 'krovel-metal', 1),
(60, 'Саморез кров. по дереву цинк 4,8* 29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(61, 'Саморез кров. по дереву цинк 4,8* 35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(62, 'Саморез кров. по дереву цинк 4,8* 51 мм (100 шт)', NULL, 'krovel-derevo', 1),
(63, 'Саморез кров. по дереву цинк 4,8* 60 мм (100 шт)', NULL, 'krovel-derevo', 1),
(64, 'Саморез кров. по дереву цинк 4,8* 70 мм (80 шт)', NULL, 'krovel-derevo', 1),
(65, 'Саморез кров. по дереву цинк 4,8* 80 мм (80 шт)', NULL, 'krovel-derevo', 1),
(66, 'Саморез кров. по дереву цинк 4,8*102 мм (50 шт)', NULL, 'krovel-derevo', 1),
(67, 'Саморез кров. по дереву (1014) слон.кость 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(68, 'Саморез кров. по дереву (1014) слон.кость 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(69, 'Саморез кров. по дереву (3005) винно-красный 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(70, 'Саморез кров. по дереву (3005) винно-красный 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(71, 'Саморез кров. по дереву (5002) ультрамарин 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(72, 'Саморез кров. по дереву (5002) ультрамарин 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(73, 'Саморез кров. по дереву (5005) синий 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(74, 'Саморез кров. по дереву (5005) синий 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(75, 'Саморез кров. по дереву (5021) бирюза 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(76, 'Саморез кров. по дереву (5021) бирюза 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(77, 'Саморез кров. по дереву (6005) тём.зелёный 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(78, 'Саморез кров. по дереву (6005) тём.зелёный 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(79, 'Саморез кров. по дереву (7004) св.серый 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(80, 'Саморез кров. по дереву (7004) св.серый 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(81, 'Саморез кров. по дереву (8017) шок.коричневый 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(82, 'Саморез кров. по дереву (8017) шок.коричневый 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(83, 'Саморез кров. по дереву (9003) белый 4,8*29 мм (200 шт)', NULL, 'krovel-derevo', 1),
(84, 'Саморез кров. по дереву (9003) белый 4,8*35 мм (150 шт)', NULL, 'krovel-derevo', 1),
(85, 'Саморез кров. по металлу цинк 5,5* 19 мм (200 шт)', NULL, 'krovel-metal', 1),
(86, 'Саморез кров. по металлу цинк 5,5* 25 мм (200 шт)', NULL, 'krovel-metal', 1),
(87, 'Саморез кров. по металлу цинк 5,5* 32 мм (150 шт)', NULL, 'krovel-metal', 1),
(88, 'Саморез кров. по металлу цинк 5,5* 38 мм (150 шт)', NULL, 'krovel-metal', 1),
(89, 'Саморез кров. по металлу цинк 5,5* 51 мм (100 шт)', NULL, 'krovel-metal', 1),
(90, 'Саморез кров. по металлу цинк 5,5* 64 мм (80 шт)', NULL, 'krovel-metal', 1),
(91, 'Саморез кров. по металлу цинк 5,5* 76 мм ( 50 шт)', NULL, 'krovel-metal', 1),
(92, 'Саморез кров. по металлу цинк 5,5*102 мм ( 50 шт)', NULL, 'krovel-metal', 1),
(93, 'Саморез кров. по металлу цинк 5,5*127 мм (50 шт)', NULL, 'krovel-metal', 1),
(94, 'Саморез кров. по металлу (1014) сл.кость 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(95, 'Саморез кров. по металлу (1014) сл.кость 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(96, 'Саморез кров. по металлу (3005) вишня 5,5*19 мм (250 шт)', NULL, 'krovel-metal', 1),
(97, 'Саморез кров. по металлу (3005) вишня 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(98, 'Саморез кров. по металлу (5002) ультрамарин 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(99, 'Саморез кров. по металлу (5002) ультрамарин 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(100, 'Саморез кров. по металлу (5005) синий 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(101, 'Саморез кров. по металлу (5005) синий 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(102, 'Саморез кров. по металлу (5021) бирюза 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(103, 'Саморез кров. по металлу (5021) бирюза 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(104, 'Саморез кров. по металлу (6005) тём.зелёный 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(105, 'Саморез кров. по металлу (6005) тём.зелёный 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(106, 'Саморез кров. по металлу (7004) серый 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(107, 'Саморез кров. по металлу (7004) серый 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(108, 'Саморез кров. по металлу (8017) шок.коричневый 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(109, 'Саморез кров. по металлу (8017) шок.коричневый 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(110, 'Саморез кров. по металлу (9003) ярко-белый 5,5*19 мм (200 шт)', NULL, 'krovel-metal', 1),
(111, 'Саморез кров. по металлу (9003) ярко-белый 5,5*25 мм (150 шт)', NULL, 'krovel-metal', 1),
(112, 'Саморез с пресшайбой острый 4,2*13 мм (100 гр)', NULL, 'pres', 1),
(113, 'Саморез с пресшайбой острый 4,2*14 мм (100 гр)', NULL, 'pres', 1),
(114, 'Саморез с пресшайбой острый 4,2*16 мм (100 гр)', NULL, 'pres', 1),
(115, 'Саморез с пресшайбой острый 4,2*19 мм (100 гр)', NULL, 'pres', 1),
(116, 'Саморез с пресшайбой острый 4,2*25 мм (100 гр)', NULL, 'pres', 1),
(117, 'Саморез с пресшайбой острый 4,2*32 мм (100 гр)', NULL, 'pres', 1),
(118, 'Саморез с пресшайбой острый 4,2*38 мм (100 гр)', NULL, 'pres', 1),
(119, 'Саморез с пресшайбой острый 4,2*41 мм (100 гр)', NULL, 'pres', 1),
(120, 'Саморез с пресшайбой острый 4,2*51 мм (100 гр)', NULL, 'pres', 1),
(121, 'Саморез с пресшайбой острый 4,2*57 мм (100 гр)', NULL, 'pres', 1),
(122, 'Саморез с пресшайбой острый 4,2*76 мм (100 гр)', NULL, 'pres', 1),
(123, 'Саморез с пресшайбой сверло 4,2*13 мм (100 гр)', NULL, 'pres', 1),
(124, 'Саморез с пресшайбой сверло 4,2*14 мм (100 гр)', NULL, 'pres', 1),
(125, 'Саморез с пресшайбой сверло 4,2*16 мм (100 гр)', NULL, 'pres', 1),
(126, 'Саморез с пресшайбой сверло 4,2*19 мм ( 100 гр)', NULL, 'pres', 1),
(127, 'Саморез с пресшайбой сверло 4,2*25 мм ( 100 гр)', NULL, 'pres', 1),
(128, 'Саморез с пресшайбой сверло 4,2*32 мм (100 гр)', NULL, 'pres', 1),
(129, 'Саморез с пресшайбой сверло 4,2*38 мм (100 гр)', NULL, 'pres', 1),
(130, 'Саморез с пресшайбой сверло 4,2*41 мм (100 гр)', NULL, 'pres', 1),
(131, 'Саморез с пресшайбой сверло 4,2*51 мм (100 гр)', NULL, 'pres', 1),
(132, 'Саморез с пресшайбой сверло 4,2*57 мм (100 гр)', NULL, 'pres', 1),
(133, 'Саморез с пресшайбой сверло 4,2*76 мм (100 гр)', NULL, 'pres', 1),
(134, 'Саморез с пресшайбой острый 4,2*13 мм (1000 шт)', NULL, 'pres', 1),
(135, 'Саморез с пресшайбой острый 4,2*14 мм (1000 шт)', NULL, 'pres', 1),
(136, 'Саморез с пресшайбой острый 4,2*16 мм (1000 шт)', NULL, 'pres', 1),
(137, 'Саморез с пресшайбой острый 4,2*19 мм (800 шт)', NULL, 'pres', 1),
(138, 'Саморез с пресшайбой острый 4,2*25 мм (600 шт)', NULL, 'pres', 1),
(139, 'Саморез с пресшайбой острый 4,2*32 мм (400 шт)', NULL, 'pres', 1),
(140, 'Саморез с пресшайбой острый 4,2*38 мм (350 шт)', NULL, 'pres', 1),
(141, 'Саморез с пресшайбой острый 4,2*41 мм (300 шт)', NULL, 'pres', 1),
(142, 'Саморез с пресшайбой острый 4,2*51 мм (200 шт)', NULL, 'pres', 1),
(143, 'Саморез с пресшайбой острый 4,2*57 мм (200 шт)', NULL, 'pres', 1),
(144, 'Саморез с пресшайбой острый 4,2*76 мм (200 шт)', NULL, 'pres', 1),
(145, 'Саморез с пресшайбой сверло 4,2*13 мм (1000 шт)', NULL, 'pres', 1),
(146, 'Саморез с пресшайбой сверло 4,2*14 мм (1000 шт)', NULL, 'pres', 1),
(147, 'Саморез с пресшайбой сверло 4,2*16 мм (1000 шт)', NULL, 'pres', 1),
(148, 'Саморез с пресшайбой сверло 4,2*19 мм ( 800 шт)', NULL, 'pres', 1),
(149, 'Саморез с пресшайбой сверло 4,2*25 мм (600 шт)', NULL, 'pres', 1),
(150, 'Саморез с пресшайбой сверло 4,2*32 мм (400 шт)', NULL, 'pres', 1),
(151, 'Саморез с пресшайбой сверло 4,2*38 мм (350 шт)', NULL, 'pres', 1),
(152, 'Саморез с пресшайбой сверло 4,2*41 мм (300 шт)', NULL, 'pres', 1),
(153, 'Саморез с пресшайбой сверло 4,2*51 мм (200 шт)', NULL, 'pres', 1),
(154, 'Саморез с пресшайбой сверло 4,2*57 мм (200 шт)', NULL, 'pres', 1),
(155, 'Саморез с пресшайбой сверло 4,2*76 мм (200 шт)', NULL, 'pres', 1),
(156, 'Саморез п/цил. острый 3,5* 9,5 мм (1000 шт)', NULL, 'klop', 1),
(157, 'Саморез п/цил. острый 3,5*11 мм (1000 шт)', NULL, 'klop', 1),
(158, 'Шуруп по бетону 7,5* 52 мм (200 шт)', NULL, 'beton', 1),
(159, 'Шуруп по бетону 7,5* 72 мм (200 шт)', NULL, 'beton', 1),
(160, 'Шуруп по бетону 7,5* 92 мм (200 шт)', NULL, 'beton', 1),
(161, 'Шуруп по бетону 7,5*112 мм (100 шт)', NULL, 'beton', 1),
(162, 'Шуруп по бетону 7,5*132 мм (100 шт)', NULL, 'beton', 1),
(163, 'Шуруп по бетону 7,5*152 мм (100 шт)', NULL, 'beton', 1),
(164, 'Шуруп по бетону 7,5*182 мм (100 шт)', NULL, 'beton', 1),
(165, 'Шуруп по бетону 7,5*202 мм (100 шт)', NULL, 'beton', 1),
(166, 'Шуруп по бетону 7,5*212 мм (100 шт)', NULL, 'beton', 1),
(167, 'Евровинт (винт-конфирмат) 7,0*50 мм (100 шт)', NULL, 'evrovint', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
